---
kind: method
id: M:Autodesk.Revit.DB.ModelCurveArrArray.ReverseIterator
source: html/b8307a6e-2ea5-12d7-39a5-7ba5740c5e66.htm
---
# Autodesk.Revit.DB.ModelCurveArrArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual ModelCurveArrArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.